{
    "posts": [
        {
            "id": 1,
            "title": "Understanding JavaScript Closures",
            "excerpt": "A deep dive into closures in JavaScript and how they work under the hood.",
            "content": "Closures are a fundamental concept in JavaScript that allow functions to access variables from an enclosing scope, even after that scope has closed. This is particularly useful for creating private variables and functions. In this post, we will explore how closures work, with examples and practical use cases.",
            "author": "Jane Doe",
            "date": "2024-05-10",
            "category": "JavaScript",
            "image": "placeholder.jpg"
        },
        {
            "id": 2,
            "title": "Getting Started with React Hooks",
            "excerpt": "Learn how to use React Hooks to manage state and side effects in functional components.",
            "content": "React Hooks revolutionized the way we write React components by allowing us to use state and other React features without writing a class. In this guide, we'll cover useState, useEffect, and custom hooks with practical examples.",
            "author": "John Smith",
            "date": "2024-06-15",
            "category": "React",
            "image": "placeholder.jpg"
        },
        {
            "id": 3,
            "title": "CSS Grid Layout Essentials",
            "excerpt": "Master the fundamentals of CSS Grid for creating responsive layouts.",
            "content": "CSS Grid is a powerful layout system that makes it easy to create complex, responsive web designs. This tutorial covers grid containers, grid items, and how to use grid template areas effectively.",
            "author": "Emily Johnson",
            "date": "2024-07-20",
            "category": "CSS",
            "image": "placeholder.jpg"
        },
        {
            "id": 4,
            "title": "Node.js Performance Optimization",
            "excerpt": "Tips and techniques for improving your Node.js application performance.",
            "content": "Performance is critical for any Node.js application. In this post, we explore clustering, caching strategies, database query optimization, and profiling tools to help you build faster applications.",
            "author": "Michael Chen",
            "date": "2024-08-05",
            "category": "Node.js",
            "image": "placeholder.jpg"
        },
        {
            "id": 5,
            "title": "Introduction to TypeScript",
            "excerpt": "Discover how TypeScript adds type safety to your JavaScript projects.",
            "content": "TypeScript is a typed superset of JavaScript that compiles to plain JavaScript. Learn about type annotations, interfaces, generics, and how TypeScript can help you catch bugs before runtime.",
            "author": "Sarah Williams",
            "date": "2024-09-12",
            "category": "TypeScript",
            "image": "placeholder.jpg"
        },
        {
            "id": 6,
            "title": "REST API Best Practices",
            "excerpt": "Build better APIs with these proven design patterns and conventions.",
            "content": "Creating a well-designed REST API is essential for modern web applications. This article covers naming conventions, HTTP methods, status codes, versioning, and authentication strategies.",
            "author": "David Brown",
            "date": "2024-10-18",
            "category": "API Design",
            "image": "placeholder.jpg"
        },
        {
            "id": 7,
            "title": "Async/Await in JavaScript",
            "excerpt": "Simplify asynchronous code with async/await syntax.",
            "content": "Async/await makes working with promises more intuitive and readable. We'll explore how to handle asynchronous operations, error handling with try/catch, and common patterns for concurrent requests.",
            "author": "Lisa Martinez",
            "date": "2024-11-25",
            "category": "JavaScript",
            "image": "placeholder.jpg"
        },
        {
            "id": 8,
            "title": "Web Security Fundamentals",
            "excerpt": "Protect your web applications from common security vulnerabilities.",
            "content": "Security should be a priority in every web application. This comprehensive guide covers XSS, CSRF, SQL injection, authentication best practices, and how to implement secure headers.",
            "author": "Robert Taylor",
            "date": "2024-12-03",
            "category": "Security",
            "image": "placeholder.jpg"
        }
    ],
    "comments": [
        {
            "id": 1,
            "postId": 1,
            "author": "Vera",
            "text": "This explanation of closures finally made it click for me!",
            "date": "2024-05-12"
        },
        {
            "id": 2,
            "postId": 1,
            "author": "Pontus",
            "text": "Great examples, especially the part about private variables.",
            "date": "2024-05-13"
        },
        {
            "id": 3,
            "postId": 2,
            "author": "Millaray",
            "text": "Hooks felt scary before, this made them feel approachable.",
            "date": "2024-06-16"
        },
        {
            "id": 4,
            "postId": 2,
            "author": "Mario",
            "text": "Would love a follow-up post about custom hooks!",
            "date": "2024-06-17"
        }
    ]
}